/*******************************************************************/
/* 1.c  输入三角形三边求此三角形面积、外接圆半径和内切圆半径       */
/*******************************************************************/
#include <stdio.h>
#include <math.h>
void main()
{
   float a,b,c,s,s1,r,r1;
   printf(" 请输入所求三角形的三条边长度 a,b,c:");
   scanf("%f,%f,%f",&a,&b,&c);
   if ((a==0)|(b==0)|(c==0))
   {
   	 	 	printf(" 这三边构不成三角形。\n");
   	 	 	return;
   }
   if ((a+b<=c)|(a+c<=b)|(b+c<=a))
   {
   	 	 	 printf(" 这三边构不成三角形。\n"); 
   	 	 	 return;      
   }
   
   if ((a==b)&&(b==c) )
   {
   	 	 	 printf(" 这是一个等边三角形。\n"); 
   	 	 	 goto q1;        
   }
   if ((a==b)|(a==c)|(b==c)) 
   {
   	 	 	 printf(" 这是一个等腰三角形。\n"); 
             goto q1;        
   }
   if (a*a+b*b==c*c) 
   {
   	 	 	 printf(" 这是一个直角三角形。\n"); 
   }
 q1:s1=(a+b+c)/2.0;
   s=sqrt(s1*(s1-a)*(s1-b)*(s1-c));
   r=a*b*c/(4.0*s);
   r1=s/s1;	 	  	 	 	  	 	 	 	 	 	  
   printf(" 这个三角形的面积s=%6.2f\n",s);
   printf(" 这个三角形的外接圆半径r=%6.2f\n",r);
   printf(" 这个三角形的内接圆半径r1=%6.2f\n",r1);
}	  	     		 	
	


