/*********************************************************/
/* 1.c  求1000以内的阿姆斯特朗数                         */
/*********************************************************/
#include <stdio.h>
void main()
{ 
   int i,t,k,a[3]={0};
   printf("\n");
   printf(" 1000以内的阿姆斯特朗数有:\n");
   for (i=2;i<=1000;i++) 
   {   	
   	 t=0;
	 k=i;
	 while (k)
	 {
      a[t]=k%10;
	  k=k/10;
	  t++;
	 }
   	 if (i==a[0]*a[0]*a[0]+a[1]*a[1]*a[1]+a[2]*a[2]*a[2])
   	 printf(" %d   ",i);
   	}
   	printf("\n");
}
